## Plan for org_account/organization
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
scp.tf
```
```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_organizations_policy.cartography_tmp_scp`                 |
|        | `aws_organizations_policy_attachment.Test-cartography_tmp_scp` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_policy.cartography_tmp_scp will be created
  + resource "aws_organizations_policy" "cartography_tmp_scp" {
      + arn      = (known after apply)
      + content  = jsonencode(
            {
              + Statement = [
                  + {
                      + Condition = {
                          + ArnNotLike      = {
                              + aws:PrincipalArn = [
                                  + "arn:aws:iam::*:role/AWSControlTowerExecution",
                                  + "arn:aws:iam::*:role/secopsAssetInventorySecurityAuditRole",
                                ]
                            }
                          + StringNotEquals = {
                              + aws:RequestedRegion = [
                                  + "us-east-1",
                                  + "us-west-2",
                                  + "ca-central-1",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + NotAction = [
                          + "wafv2:*",
                          + "waf:*",
                          + "waf-regional:*",
                          + "vendor-insights:ListEntitledSecurityProfiles",
                          + "trustedadvisor:*",
                          + "tag:GetResources",
                          + "sustainability:*",
                          + "supportplans:*",
                          + "supportapp:*",
                          + "support:*",
                          + "sts:*",
                          + "sso:*",
                          + "shield:*",
                          + "savingsplans:*",
                          + "s3:PutMultiRegionAccessPointPolicy",
                          + "s3:PutAccountPublicAccessBlock",
                          + "s3:PutAccountPublic",
                          + "s3:ListStorageLensConfigurations",
                          + "s3:ListMultiRegionAccessPoints",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetStorageLensDashboard",
                          + "s3:GetStorageLensConfiguration",
                          + "s3:GetMultiRegionAccessPointPolicyStatus",
                          + "s3:GetMultiRegionAccessPointPolicy",
                          + "s3:GetMultiRegionAccessPoint",
                          + "s3:GetBucketPublicAccessBlock",
                          + "s3:GetBucketPolicyStatus",
                          + "s3:GetBucketLocation",
                          + "s3:GetAccountPublicAccessBlock",
                          + "s3:GetAccountPublic",
                          + "s3:DescribeMultiRegionAccessPointOperation",
                          + "s3:DeleteMultiRegionAccessPoint",
                          + "s3:CreateMultiRegionAccessPoint",
                          + "route53domains:*",
                          + "route53:*",
                          + "route53-recovery-readiness:*",
                          + "route53-recovery-control-config:*",
                          + "route53-recovery-cluster:*",
                          + "resource-explorer-2:*",
                          + "pricing:*",
                          + "organizations:*",
                          + "networkmanager:*",
                          + "mobileanalytics:*",
                          + "lightsail:Get*",
                          + "license-manager:ListReceivedLicenses",
                          + "kms:*",
                          + "importexport:*",
                          + "iam:*",
                          + "health:*",
                          + "globalaccelerator:*",
                          + "fms:*",
                          + "ecr-public:*",
                          + "ec2:DescribeVpnGateways",
                          + "ec2:DescribeTransitGateways",
                          + "ec2:DescribeRegions",
                          + "discovery-marketplace:*",
                          + "directconnect:*",
                          + "devicefarm:*",
                          + "datapipeline:GetAccountLimits",
                          + "cur:*",
                          + "config:*",
                          + "compute-optimizer:*",
                          + "cloudfront:*",
                          + "chime:*",
                          + "chatbot:*",
                          + "ce:*",
                          + "budgets:*",
                          + "billingconductor:*",
                          + "aws-portal:*",
                          + "aws-marketplace:*",
                          + "aws-marketplace-management:*",
                          + "artifact:*",
                          + "activate:*",
                          + "acm:*",
                          + "account:*",
                          + "access-analyzer:*",
                          + "a4b:*",
                        ]
                      + Resource  = "*"
                      + Sid       = "GRREGIONDENYreplication"
                    },
                  + {
                      + Action    = [
                          + "iam:UpdateRolePolicy",
                          + "iam:UpdateRoleDescription",
                          + "iam:UpdateRole",
                          + "iam:UpdateAssumeRolePolicy",
                          + "iam:PutRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:DeletePolicyVersion",
                          + "iam:DeletePolicy",
                          + "iam:CreateRole",
                          + "iam:CreatePolicyVersion",
                          + "iam:CreatePolicy",
                          + "iam:AttachRolePolicy",
                        ]
                      + Condition = {
                          + ArnNotLike = {
                              + aws:PrincipalArn = "arn:aws:iam::*:role/AWSAFTExecution"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "arn:aws:iam::*:role/secopsAssetInventorySecurityAuditRole"
                      + Sid       = "PreventIAMRoleModifications"
                    },
                  + {
                      + Action    = "iam:CreateAccessKey"
                      + Condition = {
                          + ArnNotLike = {
                              + aws:PrincipalArn = "arn:aws:iam::*:role/AWSAFTExecution"
                            }
                        }
                      + Effect    = "Deny"
                      + Resource  = "arn:aws:iam::*:role/secopsAssetInventorySecurityAuditRole"
                      + Sid       = "PreventIAMAccessKeyCreation"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + id       = (known after apply)
      + name     = "Cartography Temporary SCP"
      + tags_all = (known after apply)
      + type     = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.Test-cartography_tmp_scp will be created
  + resource "aws_organizations_policy_attachment" "Test-cartography_tmp_scp" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "ou-5gsq-ectrrn9m"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.AFT"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.DumpsterFire"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Production"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.SRETools"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Sandbox"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Security"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_organizational_unit.Test"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.cartography_tmp_scp"]
WARN - plan.json - main - Missing Common Tags: ["aws_organizations_policy.cds_snc_universal_guardrails"]

27 tests, 17 passed, 10 warnings, 0 failures, 0 exceptions

```

</details>
